OFcase/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "U_IC"

dimensions      [0 1 -1 0 0 0 0];

// internalField   nonuniform List<vector>
// (
// );

internalField $U_internalField;

boundaryField
{
    inlet_low
    {
        type            fixedValue;
	value           $U_inflow_low;
    }
    inlet_up
    {
        type            fixedValue;
	value           $U_inflow_up;
    }

    outlet
    {
        type            zeroGradient;
    }

    bottomWall
    {
        type            noSlip;
    }
    
    topWall
    {
        type            slip;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
