OFcase/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "k_IC"

dimensions      [0 2 -2 0 0 0 0];

internalField $k_internalField;

boundaryField
{
    inlet_low
    {
        type            fixedValue;
        value           $k_inflow_low;
    }
    inlet_up
    {
        type            fixedValue;
        value           $k_inflow_up;
    }
    
    outlet
    {
        type            zeroGradient;
    }
    
    bottomWall
    {
        type            kqRWallFunction;
        value           uniform 1.e-15;
    }

    topWall
    {
        type            zeroGradient;
    }
    
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
