OFcase/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "nut_IC"

dimensions      [0 2 -1 0 0 0 0];

internalField   $nut_internalField;

boundaryField
{
    inlet_low
    {
        type            calculated;
        value           $nut_inflow_low;
    }
    inlet_up
    {
        type            calculated;
        value           $nut_inflow_up;
    }
    
    outlet
    {
        type            zeroGradient;
    }
    
    bottomWall
    {
        type            nutLowReWallFunction; //equiv. to fixedValue, uniform0
        value           uniform 0;
    }

    topWall
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
