OFcase/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "omega_IC"

dimensions      [0 0 -1 0 0 0 0];

internalField   $omega_internalField;

boundaryField
{
    inlet_low
    {
        type            fixedValue;
        value           $omega_inflow_low;
    }
    inlet_up
    {
        type            fixedValue;
        value           $omega_inflow_up;
    }

    outlet
    {
        type            zeroGradient;
    }
    
    bottomWall
    {
        type            omegaWallFunction;
        value           uniform 1.e13;
    }

    topWall
    {
        type            zeroGradient;
    }
    
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
