OFcase/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*	\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "yTopParams.in"

convertToMeters 1;

vertices
(
    //0
    (0 0 0)
    //1
    ($Lx 0 0)
    //2
    (0 $LyHalf 0)
    //3
    ($Lx $LyHalf 0)
    //4
    (0 $Ly 0)
    //5
    ($Lx $theta1 0)

    //6
    (0 0 1)
    //7
    ($Lx 0 1)
    //8
    (0 $LyHalf 1)
    //9
    ($Lx $LyHalf 1)
    //10
    (0 $Ly 1)
    //11
    ($Lx $theta1 1)
);

blocks
(
    hex (0 1 3 2 6 7 9 8) ($Nx 109 1)
    simpleGrading
    (
     1
     (
      //  % y-dir, % cells, expansion
      (0.003 20 1) // dy=0.00015
      (0.397 69 199) //dy 
      (0.6 20 1) // dy=0.03
     )
     1
    )
    
    hex (2 3 5 4 8 9 11 10) ($Nx 109 1)
    simpleGrading
    (
     1
     (
      (0.6 20 1)
      (0.397 69 0.005025125628140704)
      (0.003 20 1)
     )
     1
    )
);

edges
(
 spline 0 1 (
	     // ($Lx9 $theta9 0)
	     // ($Lx8 $theta8 0)
	     // ($Lx7 $theta7 0)
	     // ($Lx6 0.4 0)
	     (25 0.5 0)
	     // ($Lx4 0.6 0)
	     // ($Lx3 0.45 0)
	     // ($Lx2 $theta2 0)
	     )
 spline 6 7 (
	     // ($Lx9 $theta9 1)
	     // ($Lx8 $theta8 1)
	     // ($Lx7 $theta7 1)
	     // ($Lx6 0.45 1)
	     (25 0.5 1)
	     // ($Lx4 0.6 1)
	     // ($Lx3 0.45 1)
	     // ($Lx2 $theta2 1)
	     )
 spline 2 3 (
	     // ($Lx9 $theta9 0)
	     // ($Lx8 $theta8 0)
	     // ($Lx7 $theta7 0)
	     // ($Lx6 0.4 0)
	     (25 #calc "0.5 + $LyHalf" 0)
	     // ($Lx4 0.6 0)
	     // ($Lx3 0.45 0)
	     // ($Lx2 $theta2 0)
	     )
 spline 8 9 (
	     // ($Lx9 $theta9 0)
	     // ($Lx8 $theta8 0)
	     // ($Lx7 $theta7 0)
	     // ($Lx6 0.4 0)
	     (25 #calc "0.5 + $LyHalf" 1)
	     // ($Lx4 0.6 0)
	     // ($Lx3 0.45 0)
	     // ($Lx2 $theta2 0)
	     )
 spline 4 5 (
	     // ($Lx9 $theta9 0)
	     ($Lx8 $theta8 0)
	     ($Lx7 $theta7 0)
	     ($Lx6 $theta6 0)
	     ($Lx5 $theta5 0)
	     ($Lx4 $theta4 0)
	     ($Lx3 $theta3 0)
	     ($Lx2 $theta2 0)
	     )
 spline 10 11 (
	       // ($Lx9 $theta9 1)
	       ($Lx8 $theta8 1)
	       ($Lx7 $theta7 1)
	       ($Lx6 $theta6 1)
	       ($Lx5 $theta5 1)
	       ($Lx4 $theta4 1)
	       ($Lx3 $theta3 1)
	       ($Lx2 $theta2 1)
	       )
);

boundary
(
    bottomWall
    {
        type            wall;
        faces           (
			 (0 1 7 6)
			 );
    }

    topWall
    {
        type            wall;
        faces           (
			 (4 10 11 5)
			 );
    }

    frontAndBack
    {
        type            empty;
        faces           (
			 (0 2 3 1)
			 (6 7 9 8)
			 (2 4 5 3)
			 (8 9 11 10)
			 );
    }
    
    outlet
    {
        type            patch;
        faces           (
			 (1 3 9 7)
			 (3 5 11 9)
			 );
    }

    inlet_low
    {
        type            patch;
        faces           (
			 (0 6 8 2)
			 );
    }
    inlet_up
    {
        type            patch;
        faces           (
			 (2 8 10 4)
			 );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
