OFcase/system/yTopParams.in
theta1 2.10074;
theta2 2.25027;
theta3 2.4;
theta4 2.625;
theta5 2.55;
theta6 2.475;
theta7 2.35;
theta8 2.3;
Nx 500;
NxHalf 250;
Ny 218;
NyHalf 109;
Lx 50.000000;
Lx2 43.750000;
Lx3 37.500000;
Lx4 31.250000;
Lx5 25.000000;
Lx6 18.750000;
Lx7 12.500000;
Lx8 6.250000;
Ly 2.000000;
LyHalf 1.000000;
dt 0.100000;
tEnd 200;
